brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['default-names']
brew 'git'
brew 'ctags'
brew 'curl'
brew 'wget', args: ['with-iri']
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'tree'
brew 'webkit2png'
brew 'zopfli'
brew 'ctags'
brew 'homebrew/dupes/openssh'
brew 'zsh'
brew 'diff-so-fancy'

# Text editing
brew 'vim', args: ['override-system-vi']
brew 'neovim'
brew 'the_silver_searcher'
brew 'homebrew/dupes/grep'
brew 'tmux'

# Image related
brew 'imagemagick', args: ['with-webp', 'with-tiff']
brew 'jpegoptim'
brew 'optipng'

# Languages
brew 'rbenv'
brew 'ruby-build'
brew 'python3'
brew 'python'
brew 'node'
tap 'homebrew/php'
brew 'homebrew/php/php70', args: ['with-gmp']
brew 'homebrew/php/php70-xdebug'

# Databases
brew 'postgresql'

# Useful completions
tap 'homebrew/completions'
brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/completions/bundler-completion'
brew 'homebrew/completions/gem-completion'
brew 'homebrew/completions/open-completion'
brew 'homebrew/completions/vagrant-completion'

# GUI
tap 'caskroom/cask'
tap 'caskroom/versions'
cask 'atom'
cask 'slack'
cask 'skype'
cask 'sketch'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

# Fonts
tap 'caskroom/fonts'
cask 'font-source-code-pro'
tap  'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'
